app/controllers/property_infos_controller.rb

  def index
    @property_infos = PropertyInfo.all
---
SELECT "property_infos".* FROM "property_infos"

  def create
    @property_info = PropertyInfo.new(property_info_params)

    respond_to do |format|
      if @property_info.save
---
INSERT INTO "property_infos" ("created_at", "email", "phone_number", "postcode", "property_cost", "rent_income", "rental_period_type_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @property_info.update(property_info_params)
---
UPDATE "property_infos" SET "rent_income" = ?, "property_cost" = ?, "updated_at" = ? WHERE "property_infos"."id" = 13  [["rent_income", 1], ["property_cost", 1], ["updated_at", Wed, 19 Nov 2014 10:12:35 UTC +00:00]]

  def set_property_info
    @property_info = PropertyInfo.find(params[:id])
---
SELECT "property_infos".* FROM "property_infos" WHERE "property_infos"."id" = ? LIMIT 1  [["id", "6"]]